app/Controllers/DataStok.php

SELECT *
FROM `goldar`
---
    public function index()
    {
        if (!$this->session->has('nama') || !$this->session->has('email')) {
            return redirect()->to(base_url('login'));
        }
        $data = [
            'title' => "Bantu Donor - Data Stok Darah",
            'nama' => $this->session->get('nama'),
            'email' => $this->session->get('email'),
            'pendonor' => $this->pendonor->getDonorData(),
            'stock' => $this->pendonor->hitungTotal(),
            'rs' => $this->rs->findAll(),
            'goldar' => $this->goldar->findAll(),