app/Controllers/DataPendonor.php

    public function index()
    {
        if (!$this->session->has('nama') || !$this->session->has('email')) {
            return redirect()->to(base_url('login'));
        }
        $data = [
            'title' => "Bantu Donor - Data Pendonor",
            'nama' => $this->session->get('nama'),
            'email' => $this->session->get('email'),
            'pendonor' => $this->pendonor->getDonorData(),
            'rs' => $this->rs->findAll(),
            'goldar' => $this->goldar->findAll(),
---
SELECT *
FROM `goldar`

    public function show($id = null)
    {
        if (!$this->session->has('nama') || !$this->session->has('email')) {
            return redirect()->to(base_url('login'));
        }
        $datadonor = $this->pendonor->find($id);

        if (!$datadonor) {
            $this->session->setFlashdata('sweet_alert', json_encode(['error' => true, 'message' => 'Data tidak ada!']));
            return redirect()->to(base_url('datapendonor'));
        }
        $data = [
            'nama' => $this->session->get('nama'),
            'email' => $this->session->get('email'),
            'title' => 'Bantu Donor - Edit Data Donor',
            'rs' => $this->rs->findAll(),
            'goldar' => $this->goldar->findAll(),
---
SELECT *
FROM `pendonor`
WHERE `pendonor`.`id` = '19'
SELECT *
FROM `goldar`

    public function create()
    {
        $validasi = $this->form_validation->run($this->request->getPost(), 'datapendonor');
        if (!$this->validate('datapendonor')) {
            $this->session->setFlashdata('sweet_alert', json_encode(['error' => true, 'message' => 'Gagal tambah data']));
            return redirect()->to(base_url('datapendonor'))->withInput()->with('validation', $validasi);
        }

        $data = [
            'tanggal' => $this->request->getVar('tanggal'),
            'nama' => $this->request->getVar('nama'),
            'no_id' => $this->request->getVar('no_id'),
            'no_telp' => $this->request->getVar('no_telp'),
            'goldar_id' => $this->request->getVar('goldar_id'),
            'rs_id' => $this->request->getVar('rs_id'),
        ];
        $pendonor = $this->pendonor->insert($data);
---
INSERT INTO `pendonor` (`tanggal`, `nama`, `no_id`, `no_telp`, `goldar_id`, `rs_id`, `created_at`, `updated_at`) VALUES ('2024-06-08', 'Elon Musk', '123467575', '08332099909', '2', '2', '2024-06-08 14:39:31', '2024-06-08 14:39:31')

    public function update($id = null)
    {
        $validasi = $this->form_validation->run($this->request->getPost(), 'datapendonor');
        if (!$this->validate('datapendonor')) {
            $this->session->setFlashdata('sweet_alert', json_encode(['error' => true, 'message' => 'Gagal tambah data']));
            return redirect()->to(base_url('datapendonor'))->withInput()->with('validation', $validasi);
        }
        $datadonor = $this->pendonor->find($id);

        if (!$datadonor) {
            $this->session->setFlashdata('sweet_alert', json_encode(['error' => true, 'message' => 'Data tidak ada!']));
        }
        if ($datadonor) {
            $data = [
                'id' => $id,
                'tanggal' => $this->request->getVar('tanggal'),
                'nama' => $this->request->getVar('nama'),
                'no_id' => $this->request->getVar('no_id'),
                'no_telp' => $this->request->getVar('no_telp'),
                'goldar_id' => $this->request->getVar('goldar_id'),
                'rs_id' => $this->request->getVar('rs_id'),
                'keterangan' => $this->request->getVar('keterangan'),
            ];

            $updateDonor = $this->pendonor->save($data);
---
SELECT *
FROM `pendonor`
WHERE `pendonor`.`id` = '19'
UPDATE `pendonor` SET `id` = '19', `tanggal` = '2024-06-08', `nama` = 'Elon Musk', `no_id` = '123467575', `no_telp` = '2147483647', `goldar_id` = '1', `rs_id` = '2', `keterangan` = 'Belum Donor', `updated_at` = '2024-06-08 14:39:55'
WHERE `pendonor`.`id` IN ('19')