app/Models/PendonorModel.php

	public function getDonorData()
	{
		return $this
			->join('goldar', 'goldar.id = pendonor.goldar_id')
			->join('rumahsakit', 'rumahsakit.id = pendonor.rs_id')
			->select('pendonor.* , goldar.nama_goldar, rumahsakit.nama_rs')
			->findAll();
---
SELECT `pendonor`.*, `goldar`.`nama_goldar`, `rumahsakit`.`nama_rs`
FROM `pendonor`
JOIN `goldar` ON `goldar`.`id` = `pendonor`.`goldar_id`
JOIN `rumahsakit` ON `rumahsakit`.`id` = `pendonor`.`rs_id`

	public function hitungTotal()
	{
		return $this
			->join('goldar', 'goldar.id = pendonor.goldar_id')
			->select('pendonor.*, goldar.nama_goldar, goldar_id, COUNT(*) as stock')
			->groupBy('goldar_id')
			->findAll();
---
SELECT `pendonor`.*, `goldar`.`nama_goldar`, `goldar_id`, COUNT(*) as stock
FROM `pendonor`
JOIN `goldar` ON `goldar`.`id` = `pendonor`.`goldar_id`
GROUP BY `goldar_id`