app/Models/UserModel.php

SELECT `user`.*, `rumahsakit`.`nama_rs`
FROM `user`
JOIN `rumahsakit` ON `rumahsakit`.`id` = `user`.`rs_id`
---
	public function getUserData()
	{
		return $this
			->join('rumahsakit', 'rumahsakit.id = user.rs_id')
			->select('user.* ,  rumahsakit.nama_rs')
			->findAll();